[
  {
    "picture": "https://awolowolegal.com/wp-content/uploads/2021/05/litigation__.jpg",
    "title": "Litigation​",
    "description": "Although no one wants to face any case or litigation be that Criminal or Civil in nature but Litigations are the real fact of life for millions of people in Bangladesh. High Court cases can be lengthy in Bangladesh but effective legal service and appearance in court by Barristers and Advocates from Mr. Mahin would certainly be very effective for you. We guarantee upmost sincerity and up to date legal knowledge to argue your case in any Courts and Tribunals in Bangladesh. We have already conducted Criminal cases in Chief Metropolitan Magistrate Court, Sessions Court and High Court Division of the Supreme Court of Bangladesh. We conduct Bail petitions in any court in Bangladesh. appears in the Supreme Court of Bangladesh regularly in Civil, Criminal, Writ, Company matters. S Hossain & Associates law firm in Bangladesh is expert in bail hearing, anticipatory bail hearing, filling Writ petition in RAJUK , Eviction, service matters, Public procurement and tender issues etc. We have successfully conducted cases in chamber court of Appellate Division and full bench of Appellate Division along with our Senior Counsel. In litigation we have experience in filling CR case / petition case in CMM and CJM (Magistrate) court, conducting trials in CMM court and in Sessions court. We have vast experience in conducting cases in Artha Rin Adalat court, Nari o Shishu Nirjatan Daman Tribunal. We have experience in conducting succession case, Title suits, injunction hearing etc in Civil Courts. We conduct cases in other areas of Bangladesh as well. \r\n"
  },
  {
    "picture": "https://blog.y-axis.com/wp-content/uploads/2016/06/Immigration-2.jpg",
    "title": "Immigration​",
    "description": "We have vast experience in advising and processing F4, IR2 family immigration applications of USA for spouse, children, step children, brothers and sisters and parents. We can help in responding to RFE letters from USCIS. We also provide supports in related matters like preparing affidavit , birth certificate, correction in passport and other ID’s. We have vast experience in drafting and filling schengen Visa appeals. We also assist in Entrepreneurship and Investment Visa application in Canada for Bangladeshi citizens. During immigration process people face different issues such as mismatch in spelling of name and parents name, wrong date of birth in passport/ educational certificate. Sometimes serious lapses are found in kabin nama or talaq certificate which can jeopardize any immigration application made by spouses living abroad to bring their spose from Bangladesh. From our last 15 years experience and well established connection in different Government offices we can assist in those critical problems to take ahead your immigration applications.\r\n"
  },
  {
    "picture": "https://corpbiz.io/learning/wp-content/uploads/2020/03/Public-Interest-Litigation-PIL.jpg",
    "title": "Public Interest Litigation​",
    "description": "MR. Mahin is well awared of it’s social responsibility as a law firm in bangladesh and will take on free legal work for Public interest if any one comes with a clear case. We may also file PIL on our own motion..\r\n"
  },
  {
    "picture": "https://life.futuregenerali.in/media/1113716/tips-to-ensure-you-are-not-breaking-income-tax-law.jpg",
    "title": "Income Tax & Customs Matters​",
    "description": "We have now opened a fully operational unit for Income Tax practice. We have qualified Lawyers, Consultants and Income Tax practitioners in Bangladesh in our firm both working full time or as off counsel to advise on Tax matters. We have strong liaison with Tax officials in Bangladesh. Service provided by us the lawyers In Bangladesh in Income Tax matters:-\r\n (i) Opening e TIN (ii) Filling TAX return for individual Tax Payer (iii) Filling TAX return for Business Tax payers (iv) Contesting objections and cases in Tax Appellate Commissioner or Appellate Tribunal (v) Opening VAT Bangladesh registration number and filling VAT return (vi) Filling Reference and Writ petitions in the High Court Division regarding Income Tax , VAT or customs matter.\r\n"
  },
  {
    "picture": "https://mpatsalidou.com/wp-content/uploads/2017/10/employment-law.jpg",
    "title": "Employment Matters​",
    "description": "Employment issues is a area of law in Bangladesh which is less understood by both employees and employers. Whereas the basic objective of Employment laws are to ensure rights for the employees and also to maintain peaceful and working environment in workplaces. The Bangladesh Labour Act 2006 is the major legislation in Employment matter in Bangladesh. There are Labour Courts in major cities of Bangladesh where aggrieved employees may file cases against their employers for wrongful Dismissal, Termination, Non payment of statutory payments, discrimination etc. MR. Mahin advises and appear in cases for both employees and employers in Employment issues..\r\n"
  },
  {
    "picture": "https://www.getjustice.pk/wp-content/uploads/2022/06/Property-Disputes-.jpg",
    "title": "Property Disputes​",
    "description": "We regularly advice clients on Real estate matters specially dispute between land owner and developer, flat buyer and developer issues. We have vast experience in advising on Real Estate Development and Management Act 2010. We have successfully conducted Arbitrations and Litigations on disputes falling under Real Estate Development and Management Act 2010. We provide services to people living outside Bangladesh who have family property in Bangladesh. We provide support from collecting documents, deeds, Porchas to do Namjari in the names of current owner and we also assist in selling lands in Bangladesh. We lawyers in Bangladesh provide complete support to people living outside Bangladesh but who has property in Bangladesh.\r\n"
  }
]
